## Task: calculating the mean

source: Python Data Analysis (Packt, 2021), Page 90

[stackoverflow answer on axis](https://stackoverflow.com/questions/22149584/what-does-axis-in-pandas-mean)

In [1]:
import pandas as pd

In [12]:
data = {"column 1": [2,5],
       "column 2": [2,3]}

In [13]:
data

{'column 1': [2, 5], 'column 2': [2, 3]}

In [14]:
data = pd.DataFrame(data)

In [15]:
data

   column 1  column 2
0         2         2
1         5         3

In [16]:
data.mean(axis = 0)

column 1    3.5
column 2    2.5
dtype: float64

In [17]:
data.mean(axis = 1)

0    2.0
1    4.0
dtype: float64

In [23]:
# Create dataframe
sample_data = {'name': ['John', 'Alia', 'Ananya', 'Steve', 'Ben'],
'gender': ['M', 'F', 'F', 'M', 'M'],
'communication_skill_score': [40, 45, 23, 39, 39],
'quantitative_skill_score': [38, 41, 42, 48, 32]}


data2 = pd.DataFrame(sample_data)

In [24]:
data2

     name gender  communication_skill_score  quantitative_skill_score
0    John      M                         40                        38
1    Alia      F                         45                        41
2  Ananya      F                         23                        42
3   Steve      M                         39                        48
4     Ben      M                         39                        32

In [25]:
data2.mean(axis=0)

communication_skill_score    37.2
quantitative_skill_score     40.2
dtype: float64

In [26]:
data2.mean(axis=1)

0    39.0
1    43.0
2    32.5
3    43.5
4    35.5
dtype: float64

In [29]:
data3 = data2.set_index("name")

In [30]:
data3

       gender  communication_skill_score  quantitative_skill_score
name
John        M                         40                        38
Alia        F                         45                        41
Ananya      F                         23                        42
Steve       M                         39                        48
Ben         M                         39                        32

In [31]:
data3.mean(axis = 1)

name
John      39.0
Alia      43.0
Ananya    32.5
Steve     43.5
Ben       35.5
dtype: float64

In [32]:
data3.mean(axis=0)

communication_skill_score    37.2
quantitative_skill_score     40.2
dtype: float64